"""
https://mishka-knizhka.ru/rasskazy-dlya-detej/rasskazy-nosova/zhivaya-shlyapa/
"""



TEXT1 = [
    "Шляпа лежала на комоде, котенок Васька сидел на полу возле комода. ",
    "А Вовка и Вадик сидели за столом и раскрашивали картинки.",
    "Вдруг, позади них что-то плюхнулось — упало на пол.",
    "Они обернулись и увидели на полу возле комода - шляпу.",
    "Вовка подошел к комоду, нагнулся, хотел поднять шляпу — и вдруг как закричит!",
    "Вадик подошел поближе и стал смотреть на шляпу. ",
    "Вдруг шляпа поползла прямо к нему, он как закричит!",
    "Шляпа вылезла на середину комнаты и остановилась. ",
    "Ребята смотрят на нее и трясутся от страха.",
]

# https://mishka-knizhka.ru/rasskazy-dlya-detej/rasskazy-dragunskogo/esli-by-ja-byl-vzroslym/

TEXT2 = [
    "Один раз я сидел, сидел и ни с того ни с сего вдруг такое надумал, что даже сам удивился.",
    "Я надумал, что вот как хорошо было бы, если бы все вокруг на свете было устроено наоборот. ",
    "Ну вот, например, чтобы дети были во всех делах главные и взрослые должны были бы их во всем, во всем слушаться. ",
    "В общем, чтобы взрослые были как дети, а дети как взрослые. ",
    "Вот это было бы замечательно, очень было бы интересно.",
]

# https://mishka-knizhka.ru/rasskazy-dlya-detej/rasskazy-nosova/bobik-v-gostjah-u-barbosa/

TEXT3 = [
    "Жил-был пёс Барбоска, у него был друг — кот Васька, оба они жили у дедушки. ",
    "Дедушка ходил на работу, Барбоска сторожил дом, а кот Васька мышей ловил.",
    "Однажды дедушка ушёл на работу, кот Васька убежал куда-то гулять, а Барбос дома остался.",
    "От нечего делать он залез на подоконник и стал смотреть в окно. ",
    "Ему было скучно, вот он и зевал по сторонам.",
    "Дедушке нашему хорошо! — подумал Барбоска. — Ушёл на работу и работает.",
    "Ваське тоже неплохо — убежал из дому и гуляет по крышам. ",
    "А мне вот приходится сидеть, сторожить квартиру."
]

# https://mishka-knizhka.ru/rasskazy-dlya-detej/rasskazy-nosova/tuk-tuk-tuk/

TEXT4 = [
    "Мы втроём — я, Мишка и Костя — приехали в пионерлагерь на день раньше всего отряда. ",
    "У нас было задание: украсить помещение к приезду ребят. ",
    "Мы сами просили нашего вожатого Витю отправить нас вперёд, нам очень хотелось поскорей в лагерь.",
    "Витя согласился и сам поехал с нами, когда мы приехали, в доме уже заканчивалась уборка. ",
    "Мы развесили на стенах плакаты, картины, которые привезли с собой. ",
    "Потом нарезали из разноцветной бумаги флажков, нанизали их на верёвочки и повесили под потолком. ",
    "Потом нарвали в поле цветов, наделали из них букетов и расставили на окнах, в банках с водой — хорошо получилось!",
]

# https://mishka-knizhka.ru/rasskazy-dlya-detej/rasskazy-nosova/mishkina-kasha/

TEXT5 = [
    "Один раз, когда я жил с мамой на даче, ко мне в гости приехал Мишка. ",
    "Я так обрадовался, что и сказать нельзя! Я очень по Мишке соскучился. Мама тоже была рада его приезду.",
    "— Это очень хорошо, что ты приехал, — сказала она. — Вам вдвоём здесь веселей будет. ",
    "Мне, кстати, завтра надо в город поехать. Я, может быть, задержусь. ",
    "Проживёте тут без меня два дня? — Конечно, проживём, — говорю я. — Мы не маленькие!",
    "— Только вам тут придётся самим обед готовить. Сумеете?",
    "— Сумеем, — говорит Мишка. — Чего там не суметь!",
    "— Ну, сварите суп и кашу. Кашу ведь просто варить.",
]

TEXT_LIST = [
    TEXT1,
    TEXT2,
    TEXT3,
    TEXT4,
    TEXT5
]